# CreateVPLrOvrd

## Description
Creates a new layer override, initially set to the layer's current properties.

```pascal
PROCEDURE CreateVPLrOvrd(
				viewportHandle : HANDLE;
				layerHandle    : HANDLE);
```

```python

def vs.CreateVPLrOvrd(viewportHandle, layerHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|
|layerHandle|HANDLE|The layer to override.|

## See Also
VS Functions:
RemoveVPLrOvrd

## Version
Availability: from Vectorworks 2014
## Category
* Viewports